heardrwt/Xiaomi-M365-Display/nRF5_SDK/examples/ble_peripheral/experimental_ble_app_lns/main.c
#define FIRST_CONN_PARAMS_UPDATE_DELAY       APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER)      /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY        APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER)      /**< Time between each call to sd_ble_gap_conn_param_update after the first (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT         3                                               /**< Number of attempts before giving up the connection parameter negotiation. */

#define SEC_PARAM_BOND                       1                                               /**< Perform bonding. */
#define SEC_PARAM_MITM                       0                                               /**< Man In The Middle protection not required. */
#define SEC_PARAM_LESC                       0                                               /**< LE Secure Connections not enabled. */
#define SEC_PARAM_KEYPRESS                   0                                               /**< Keypress notifications not enabled. */
#define SEC_PARAM_IO_CAPABILITIES            BLE_GAP_IO_CAPS_NONE                            /**< No I/O capabilities. */
#define SEC_PARAM_OOB                        0                                               /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE               7                                               /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE               16                                              /**< Maximum encryption key size. */

#define DEAD_BEEF                            0xDEADBEEF                                      /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

static uint16_t                              m_conn_handle = BLE_CONN_HANDLE_INVALID;        /**< Handle of the current connection. */
static ble_bas_t                             m_bas;                                          /**< Structure used to identify the battery service. */
static ble_lns_t                             m_lns;                                          /**< Structure used to identify the location and navigation service. */

static sensorsim_cfg_t                       m_battery_sim_cfg;                              /**< Battery Level sensor simulator configuration. */
static sensorsim_state_t                     m_battery_sim_state;                            /**< Battery Level sensor simulator state. */

APP_TIMER_DEF(m_battery_timer_id);                                                           /**< Battery timer. */
APP_TIMER_DEF(m_loc_and_nav_timer_id);                                                       /**< Location and navigation measurement timer. */

static ble_lns_loc_speed_t                   m_sim_location_speed;                           /**< Location and speed simulation. */
static ble_lns_pos_quality_t                 m_sim_position_quality;                         /**< Position measurement quality simulation. */
static ble_lns_navigation_t                  m_sim_navigation;                               /**< Navigation data structure simulation. */

static ble_uuid_t                            m_adv_uuids[] = {
                                                               {BLE_UUID_LOCATION_AND_NAVIGATION_SERVICE,  BLE_UUID_TYPE_BLE},
                                                               {BLE_UUID_BATTERY_SERVICE,                  BLE_UUID_TYPE_BLE},
                                                               {BLE_UUID_DEVICE_INFORMATION_SERVICE,       BLE_UUID_TYPE_BLE}
                                                             };

static const ble_lns_loc_speed_t initial_lns_location_speed = {
    .instant_speed_present   = true,
    .total_distance_present  = true,
    .location_present        = true,
    .elevation_present       = true,
    .heading_present         = true,
    .rolling_time_present    = true,
    .utc_time_time_present   = true,
    .position_status         = BLE_LNS_POSITION_OK,
    .data_format             = BLE_LNS_SPEED_DISTANCE_FORMAT_2D,
    .elevation_source        = BLE_LNS_ELEV_SOURCE_POSITIONING_SYSTEM,
    .heading_source          = BLE_LNS_HEADING_SOURCE_COMPASS,
    .instant_speed           = 12,         // = 1.2 meter/second
    .total_distance          = 2356,       // = 2356 meters/second
    .latitude                = -103123567, // = -10.3123567 degrees
    .longitude               = 601234567,  // = 60.1234567 degrees
    .elevation               = 1350,       // = 13.5 meter
    .heading                 = 2123,       // = 21.23 degrees
    .rolling_time            = 1,          // = 1 second
    .utc_time                = {
                                 .year    = 2015,
                                 .month   = 7,
                                 .day     = 8,
                                 .hours   = 12,
                                 .minutes = 43,
                                 .seconds = 33
                               }
};


static const ble_lns_pos_quality_t initial_lns_pos_quality = {
    .number_of_satellites_in_solution_present = true,
    .number_of_satellites_in_view_present     = true,
    .time_to_first_fix_present                = true,
    .ehpe_present                             = true,
    .evpe_present                             = true,
    .hdop_present                             = true,
    .vdop_present                             = true,
    .position_status                          = BLE_LNS_POSITION_OK,
    .number_of_satellites_in_solution         = 5,
    .number_of_satellites_in_view             = 6,
    .time_to_first_fix                        = 63,  // = 6.3 seconds
    .ehpe                                     = 100, // = 1 meter
    .evpe                                     = 123, // = 1.23 meter
    .hdop                                     = 123,
    .vdop                                     = 143
};

static const ble_lns_navigation_t initial_lns_navigation = {
    .remaining_dist_present       = true,
    .remaining_vert_dist_present  = true,
    .eta_present                  = true,
    .position_status              = BLE_LNS_POSITION_OK,
    .heading_source               = BLE_LNS_HEADING_SOURCE_COMPASS,
    .navigation_indicator_type    = BLE_LNS_NAV_TO_WAYPOINT,
    .waypoint_reached             = false,
    .destination_reached          = false,
    .bearing                      = 1234,   // = 12.34 degrees
    .heading                      = 2123,   // = 21.23 degrees
    .remaining_distance           = 532576, // = 53257.6 meters
    .remaining_vert_distance      = 123,    // = 12.3 meters
    .eta                          = {
                                      .year    = 2015,
                                      .month   = 7,
                                      .day     = 8,
                                      .hours   = 16,
                                      .minutes = 43,
                                      .seconds = 33
                                   }
};

static void advertising_start(void);

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


