heardrwt/Xiaomi-M365-Display/nRF5_SDK/examples/ble_peripheral/experimental_ble_app_lns/main.c
/**@brief Function for handling the Battery measurement timer time-out.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the time-out handler.
 */
static void battery_level_meas_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    battery_level_update();
}


static void increment_time(ble_date_time_t * p_time)
{
    p_time->seconds++;
    if (p_time->seconds > 59)
    {
        p_time->seconds = 0;
        p_time->minutes++;
        if (p_time->minutes > 59)
        {
            p_time->minutes = 0;
            p_time->hours++;
            if (p_time->hours > 24)
            {
                p_time->hours = 0;
                p_time->day++;
                if (p_time->day > 31)
                {
                    p_time->day = 0;
                    p_time->month++;
                    if (p_time->month > 12)
                    {
                        p_time->year++;
                    }
                }
            }
        }
    }
}


static void navigation_simulation_update(void)
{
    // ugly updating of status
    m_sim_navigation.position_status           = (ble_lns_pos_status_type_t)
                                                 (
                                                    ( (uint32_t) m_sim_navigation.position_status + 1) %
                                                    ( (uint32_t) BLE_LNS_LAST_KNOWN_POSITION + 1)
                                                 );
    m_sim_navigation.heading_source            = (ble_lns_heading_source_t)
                                                 (
                                                    ( (uint32_t) m_sim_navigation.heading_source  + 1) %
                                                    ( (uint32_t) BLE_LNS_HEADING_SOURCE_COMPASS + 1)
                                                 );
    m_sim_navigation.navigation_indicator_type = (ble_lns_nav_indicator_type_t)
                                                 (
                                                    ( (uint32_t) m_sim_navigation.navigation_indicator_type + 1) %
                                                    ( (uint32_t) BLE_LNS_NAV_TO_DESTINATION + 1)
                                                 );

    m_sim_navigation.waypoint_reached    = !m_sim_navigation.waypoint_reached;
    m_sim_navigation.destination_reached = !m_sim_navigation.destination_reached;
    m_sim_navigation.bearing++;
    m_sim_navigation.heading++;
    m_sim_navigation.remaining_distance++;
    m_sim_navigation.remaining_vert_distance++;

    increment_time(&m_sim_navigation.eta);
}


static void position_quality_simulation_update(void)
{
    // ugly updating of status
    m_sim_position_quality.position_status = (ble_lns_pos_status_type_t)
                                             (
                                                ( (uint32_t) m_sim_position_quality.position_status + 1) %
                                                ( (uint32_t) BLE_LNS_LAST_KNOWN_POSITION + 1)
                                             );
    m_sim_position_quality.number_of_satellites_in_solution++;
    m_sim_position_quality.number_of_satellites_in_view++;
    m_sim_position_quality.time_to_first_fix++;
    m_sim_position_quality.ehpe++;
    m_sim_position_quality.evpe++;
    m_sim_position_quality.hdop++;
    m_sim_position_quality.vdop++;
}


/**@brief Provide simulated location and speed.
 */
static void loc_speed_simulation_update(void)
{
    // ugly updating of status
    m_sim_location_speed.position_status  = (ble_lns_pos_status_type_t)
                                            (
                                                ( (uint32_t) m_sim_location_speed.position_status + 1) %
                                                ( (uint32_t) BLE_LNS_LAST_KNOWN_POSITION + 1)
                                            );
    m_sim_location_speed.data_format      = (ble_lns_speed_distance_format_t)
                                            (
                                                ( (uint32_t) m_sim_location_speed.data_format + 1) %
                                                ( (uint32_t) BLE_LNS_SPEED_DISTANCE_FORMAT_3D + 1)
                                            );
    m_sim_location_speed.elevation_source = (ble_lns_elevation_source_t)
                                            (
                                                ( (uint32_t) m_sim_location_speed.elevation_source + 1) %
                                                ( (uint32_t) BLE_LNS_ELEV_SOURCE_OTHER + 1)
                                            );
    m_sim_location_speed.heading_source   = (ble_lns_heading_source_t)
                                            (
                                                ( (uint32_t) m_sim_location_speed.heading_source + 1) %
                                                ( (uint32_t) BLE_LNS_HEADING_SOURCE_COMPASS + 1)
                                            );
    m_sim_location_speed.total_distance++;
    m_sim_location_speed.latitude++;
    m_sim_location_speed.longitude++;
    m_sim_location_speed.elevation++;
    m_sim_location_speed.heading++;
    m_sim_location_speed.rolling_time++;

    increment_time(&m_sim_location_speed.utc_time);
}


/**@brief Location and navigation time-out handler.
 *
 * @details This function will be called each time the location and navigation measurement timer expires.
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the time-out handler.
 */
static void loc_and_nav_timeout_handler(void * p_context)
{
    uint32_t err_code;

